NordicSemiconductor/nrfx/bsp/stable/mdk/iar_startup_nrf7120_enga_flpr.s
        PUBWEAK SuperVisorSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorSoftware_Handler
        j .

        PUBWEAK MachineSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineSoftware_Handler
        j .

        PUBWEAK UserTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserTimer_Handler
        j .

        PUBWEAK SuperVisorTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorTimer_Handler
        j .

        PUBWEAK MachineTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineTimer_Handler
        j .

        PUBWEAK UserExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserExternal_Handler
        j .

        PUBWEAK SuperVisorExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorExternal_Handler
        j .

        PUBWEAK MachineExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineExternal_Handler
        j .

        PUBWEAK CLICSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLICSoftware_Handler
        j .


       ; Dummy interrupt handlers

        PUBWEAK  VPRCLIC_16_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_16_IRQHandler
        j .

        PUBWEAK  VPRCLIC_17_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_17_IRQHandler
        j .

        PUBWEAK  VPRCLIC_18_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_18_IRQHandler
        j .

        PUBWEAK  VPRCLIC_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_19_IRQHandler
        j .

        PUBWEAK  VPRCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_20_IRQHandler
        j .

        PUBWEAK  VPRCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_21_IRQHandler
        j .

        PUBWEAK  VPRCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_22_IRQHandler
        j .

        PUBWEAK  VPRTIM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRTIM_IRQHandler
        j .

        PUBWEAK  SPU00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU00_IRQHandler
        j .

        PUBWEAK  MPC00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC00_IRQHandler
        j .

        PUBWEAK  MPC03_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC03_IRQHandler
        j .

        PUBWEAK  AAR00_CCM00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR00_CCM00_IRQHandler
        j .

        PUBWEAK  ECB00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB00_IRQHandler
        j .

        PUBWEAK  VPR00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR00_IRQHandler
        j .

        PUBWEAK  SERIAL00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL00_IRQHandler
        j .

        PUBWEAK  MRAMC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC_IRQHandler
        j .

        PUBWEAK  CTRLAP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CTRLAP_IRQHandler
        j .

        PUBWEAK  CM33SS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CM33SS_IRQHandler
        j .

        PUBWEAK  TIMER00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER00_IRQHandler
        j .

        PUBWEAK  EGU00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU00_IRQHandler
        j .

        PUBWEAK  CRACEN_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CRACEN_IRQHandler
        j .

        PUBWEAK  USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHS_IRQHandler
        j .

        PUBWEAK  QSPI00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI00_IRQHandler
        j .

        PUBWEAK  QSPI01_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI01_IRQHandler
        j .

        PUBWEAK  SERIAL01_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL01_IRQHandler
        j .

        PUBWEAK  SPU10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU10_IRQHandler
        j .

        PUBWEAK  TIMER10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER10_IRQHandler
        j .

        PUBWEAK  EGU10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU10_IRQHandler
        j .

        PUBWEAK  RADIO_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIO_0_IRQHandler
        j .

        PUBWEAK  RADIO_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIO_1_IRQHandler
        j .

        PUBWEAK  IPCT10_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT10_0_IRQHandler
        j .

        PUBWEAK  IPCT10_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT10_1_IRQHandler
        j .

        PUBWEAK  IPCT10_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT10_2_IRQHandler
        j .

        PUBWEAK  IPCT10_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT10_3_IRQHandler
        j .

        PUBWEAK  SPU20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU20_IRQHandler
        j .

        PUBWEAK  SERIAL20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL20_IRQHandler
        j .

        PUBWEAK  SERIAL21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL21_IRQHandler
        j .

        PUBWEAK  SERIAL22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL22_IRQHandler
        j .

        PUBWEAK  EGU20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU20_IRQHandler
        j .

        PUBWEAK  TIMER20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER20_IRQHandler
        j .

        PUBWEAK  TIMER21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER21_IRQHandler
        j .

        PUBWEAK  TIMER22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER22_IRQHandler
        j .

        PUBWEAK  TIMER23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER23_IRQHandler
        j .

        PUBWEAK  TIMER24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER24_IRQHandler
        j .

        PUBWEAK  PDM20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM20_IRQHandler
        j .

        PUBWEAK  PDM21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM21_IRQHandler
        j .

